Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Code objects represent *byte-compiled* executable Python code, or :term:`bytecode`. The difference between a code object and a function object is that the function object contains an explicit reference to the function's globals (the module in which it was defined), while a code object contains no context; also the default argument values are stored in the function object, not in the code object (because they represent values calculated at run-time). Unlike function objects, code objects are immutable and contain no references (directly or indirectly) to mutable objects.
ru: Объекты кода представляют собой скомпилированный в байт-код (:term:`bytecode`) исполняемый код Питона. Разница между объектом кода и объектом функции заключается в том, что объект функции содержит явное указание на область имён, в которой содержатся глобальные переменные функции (модуль, в котором она была определена), а объект кода не содержит указания на такой контекст; также в объекте функции хранятся значения по умолчанию аргументов, а в объекте кода их нет (так как они представляют собой значения, рассчитываемые во время выполнения). В отличие от объектов функций, объекты кода являются неизменяемыми и не содержать ссылок (прямо или косвенно) на изменяемые объекты.

source: Special read-only attributes: :attr:`co_name` gives the function name; :attr:`co_argcount` is the number of positional arguments (including arguments with default values); :attr:`co_nlocals` is the number of local variables used by the function (including arguments); :attr:`co_varnames` is a tuple containing the names of the local variables (starting with the argument names); :attr:`co_cellvars` is a tuple containing the names of local variables that are referenced by nested functions; :attr:`co_freevars` is a tuple containing the names of free variables; :attr:`co_code` is a string representing the sequence of bytecode instructions; :attr:`co_consts` is a tuple containing the literals used by the bytecode; :attr:`co_names` is a tuple containing the names used by the bytecode; :attr:`co_filename` is the filename from which the code was compiled; :attr:`co_firstlineno` is the first line number of the function; :attr:`co_lnotab` is a string encoding the mapping from bytecode offsets to line numbers (for details see the source code of the interpreter); :attr:`co_stacksize` is the required stack size (including local variables); :attr:`co_flags` is an integer encoding a number of flags for the interpreter.
ru: Специальные атрибуты только для чтения: :attr:`co_name` содержит имя данной функции; :attr:`co_argcount` это количество позиционных аргументов (в том числе аргументов со значениями по умолчанию); :attr:`co_nlocals` это число локальных переменных, используемых функцией (включая аргументы); :attr:`co_varnames` кортеж, содержащий имена локальных переменных (начиная с имен аргументов); :attr:`co_cellvars` кортеж, содержащий имена локальных переменных, на которые ссылаются вложенные функции; :attr:`co_freevars` кортеж, содержащий имена свободных (нигде более не связанных) переменных; :attr:`co_code` строка, представляющая последовательность байт-код инструкций; :attr:`co_consts` кортеж, содержащий непосредственные данные используемые байт-кодом; :attr:`co_names` кортеж, содержащий имена, используемые байт-кодом; :attr:`co_filename` имя файла, из которого код был скомпилирован; :attr:`co_firstlineno` номер первой строки функции; :attr:`co_lnotab` текст, кодирующий соответствие смещения байт-кодов номерам строк текста программы (подробнее см. исходный код интерпретатора); :attr:`co_stacksize` требуемый размер стека (включая локальные переменные); :attr:`co_flags` целое число, в котором закодировано некоторое количество параметров(флагов) интерпретатора.

source: The following flag bits are defined for :attr:`co_flags`: bit ``0x04`` is set if the function uses the ``*arguments`` syntax to accept an arbitrary number of positional arguments; bit ``0x08`` is set if the function uses the ``**keywords`` syntax to accept arbitrary keyword arguments; bit ``0x20`` is set if the function is a generator.
ru: Следующие сигнальные биты определены внутри :attr:`co_flags` : бит ``0x04`` установлен, если данная функция использует синтаксис ``*arguments`` для принятия произвольного количеотва позиционных аргументов; бит ``0x08`` установлен, если данная функция использует синтаксис ``**keywords`` для принятия произвольных именованных аргументов; бит ``0x20`` установлен, если функция является генератором.

source: Future feature declarations (``from __future__ import division``) also use bits in :attr:`co_flags` to indicate whether a code object was compiled with a particular feature enabled: bit ``0x2000`` is set if the function was compiled with future division enabled; bits ``0x10`` and ``0x1000`` were used in earlier versions of Python.
ru: Инструкция ``from __future__ import division`` также использует биты в :attr:`co_flags` для обозначения того, был ли объект-код скомпилирован со включенными определёнными свойствами. Так, бит ``0x2000`` установлен, если данная функция скомпилирована с задействованием ``future division`` . Биты ``0x10`` и ``0x1000`` использовались в более ранних версиях Питона.

source: Other bits in :attr:`co_flags` are reserved for internal use.
ru: Другие биты в :attr:`co_flags` - зарезервированы для внутреннего использования.

source: If a code object represents a function, the first item in :attr:`co_consts` is the documentation string of the function, or ``None`` if undefined.
ru: Если объект кода является функцией, то первый элемент в :attr:`co_consts` содержит текст описания (документацию) данной функции, или значение «:const:`None`» .

source: Frame objects represent execution frames. They may occur in traceback objects (see below).
ru: Объекты-:term:`кадры<execution frame object>` реализуют кадры исполнения. Они могут встречаться в :term:`объектах раскрутки стека<traceback object>` (смотри́те далее) .

source: Special read-only attributes: :attr:`f_back` is to the previous stack frame (towards the caller), or ``None`` if this is the bottom stack frame; :attr:`f_code` is the code object being executed in this frame; :attr:`f_locals` is the dictionary used to look up local variables; :attr:`f_globals` is used for global variables; :attr:`f_builtins` is used for built-in (intrinsic) names; :attr:`f_lasti` gives the precise instruction (this is an index into the bytecode string of the code object).
ru: Специальные атрибуты только для чтения: :attr:`f_back` указывает предыдущий кадр стека (в сторону вызывающего), или «:const:`None`» если это дно стека; :attr:`f_code` является объектом-кодом, выполняющимся в данном кадре; :attr:`f_locals` является словарём, использующимся для поиска локальных переменных; :attr:`f_globals` используется для глобальных переменных; :attr:`f_builtins` используется для встроенных (внутренних) имён; :attr:`f_lasti` дает точные инструкции (это индекс в массиве байт-кода у объекта кода) .

source: Special writable attributes: :attr:`f_trace`, if not ``None``, is a function called at the start of each source code line (this is used by the debugger); :attr:`f_lineno` is the current line number of the frame --- writing to this from within a trace function jumps to the given line (only for the bottom-most frame). A debugger can implement a Jump command (aka Set Next Statement) by writing to f_lineno.
ru: Специальные перезаписываемые атрибуты: «:attr:`f_trace`» , если не «:const:`None`» , является функцией, вызываемою в начале каждой строки исходного кода (это используется отладчиком); «:attr:`f_lineno`» содержит номер текущей строки кадра – запись сюда изнутри функции отслеживания (трассирования) приводит к переходу на данную строку (только для самого нижнего кадра) . Отладчик может реализовать команду “Jump” , путём записи в «:attr:`f_lineno`» .

source: Traceback objects represent a stack trace of an exception. A traceback object is created when an exception occurs. When the search for an exception handler unwinds the execution stack, at each unwound level a traceback object is inserted in front of the current traceback. When an exception handler is entered, the stack trace is made available to the program. (See section :ref:`try`.) It is accessible as the third item of the tuple returned by ``sys.exc_info()``. When the program contains no suitable handler, the stack trace is written (nicely formatted) to the standard error stream; if the interpreter is interactive, it is also made available to the user as ``sys.last_traceback``.
ru: Объекты раскрутки стека представляют раскрутку стека исключений. Объект раскрутки стека создается при возникновении исключения. Когда поиск обработчика исключения раскручивает стек вызовов, на каждом уровне новый объект раскрутки стека вставляется перед текущим. Когда обработчик исключения найден, раскрутка стека делается доступной для программы. (Смотри́те раздел :ref:`try` .) Она доступна в качестве третьего элемента кортежа, возвращаемого :func:`sys.exc_info` . Если программа не содержит подходящего обработчика, раскрутка стека выводится (в удобно оформленном виде) в стандартный поток ошибок, а если интерпретатор в интерактивном режиме, то она также доступна пользователю через :data:`sys.last_traceback` .

source: Special read-only attributes: :attr:`tb_next` is the next level in the stack trace (towards the frame where the exception occurred), or ``None`` if there is no next level; :attr:`tb_frame` points to the execution frame of the current level; :attr:`tb_lineno` gives the line number where the exception occurred; :attr:`tb_lasti` indicates the precise instruction. The line number and last instruction in the traceback may differ from the line number of its frame object if the exception occurred in a :keyword:`try` statement with no matching except clause or with a finally clause.
ru: Специальные атрибуты только для чтения: «:attr:`tb_next`» указывает следующий уровень в стеке (в сторону кадра, где произошло исключение) , или «:const:`None`» , если нет следующего уровня; «:attr:`tb_frame`» указывает на кадр исполнения текущего уровня; «:attr:`tb_lineno`» дает номер строки, где произошло исключение; «:attr:`tb_lasti`» указывает точную инструкцию. Номер строки и последняя команда в раскрутке может отличаться от номера строки соответствующего объекта кадра, если исключение произошло в инструкции «:keyword:`try`» не имеющей соответствующей ветви «:keyword:`except`» , или с ветвью «:keyword:`finally`» .

source: Slice objects are used to represent slices for :meth:`__getitem__` methods. They are also created by the built-in :func:`slice` function.
ru: Объекты-срезы используются для хранения параметров для операции среза (которая может быть явно вызвана через метод «:meth:`__getitem__`» ) . Объект-срез также может быть создан встроенной функцией «:func:`slice`» .

source: Special read-only attributes: :attr:`start` is the lower bound; :attr:`stop` is the upper bound; :attr:`step` is the step value; each is ``None`` if omitted. These attributes can have any type.
ru: Особые атрибуты только для чтения::attr:`start` - нижняя граница;:attr:`stop` - верхняя граница;:attr:`step` - значение шага;все они по умолчанию имеют значение «:const:`None`» . Эти атрибуты могут быть любого типа.

source: Slice objects support one method:
ru: Объекты-срезы поддерживают один метод:

source: This method takes a single integer argument *length* and computes information about the slice that the slice object would describe if applied to a sequence of *length* items. It returns a tuple of three integers; respectively these are the *start* and *stop* indices and the *step* or stride length of the slice. Missing or out-of-bounds indices are handled in a manner consistent with regular slices.
ru: Этот метод принимает один аргумент - целое число *length* и преобразовывает параметры среза (пропущенные, выходящие за границы (отрицательные или превышающие)) так, как они были бы преобразованы будучи применёнными (к любой) последовательности длины *length* (т. е. , например, граница среза, превышающая длину, заменяется на эту длину). Именно это преобразование производится при обычной записи срезов. Этот метод возвращает кортеж из 3 целых чисел, являющихся соответственно параметрами *start*, *stop*, *step* .

source: Static method objects provide a way of defeating the transformation of function objects to method objects described above. A static method object is a wrapper around any other object, usually a user-defined method object. When a static method object is retrieved from a class or a class instance, the object actually returned is the wrapped object, which is not subject to any further transformation. Static method objects are not themselves callable, although the objects they wrap usually are. Static method objects are created by the built-in :func:`staticmethod` constructor.
ru: Статические методы обеспечивают способ предотвращения преобразования функций в методы, описанные выше. Статические методы могут быть посредниками (“обертками”) для любых других объектов, обычно для определяемых пользователем методов. Когда статический метод запрашивается из класса или экземпляра класса, то фактически возвращается объект, к которому тот является посредником (т.е. “обёрнутый объект”), если он в свою очередь не подлежит дальнейшей трансформации. Статические методы сами не являются исполнимыми, хотя те объекты, к которым они явлвются посредниками - обычно явлвются. Статические методы создаются при помощи встроенного конструктора :func:`staticmethod` .

source: A class method object, like a static method object, is a wrapper around another object that alters the way in which that object is retrieved from classes and class instances. The behaviour of class method objects upon such retrieval is described above, under "User-defined methods". Class method objects are created by the built-in :func:`classmethod` constructor.
ru: Метод класса, как и статический метод, является посредником к другому объекту, изменяющим способ, которым этот объект извлекается из классов и экземпляров класса. Поведение метода класса при таком доступе описано выше, в разделе “Определяемые пользователем методы” . Методы классов создаются при помощи встроенного конструктора :func:`classmethod` .

source: Special method names
ru: Имена спецальных методов

source: A class can implement certain operations that are invoked by special syntax (such as arithmetic operations or subscripting and slicing) by defining methods with special names. This is Python's approach to :dfn:`operator overloading`, allowing classes to define their own behavior with respect to language operators. For instance, if a class defines a method named :meth:`__getitem__`, and ``x`` is an instance of this class, then ``x[i]`` is roughly equivalent to ``type(x).__getitem__(x, i)``. Except where mentioned, attempts to execute an operation raise an exception when no appropriate method is defined (typically :exc:`AttributeError` or :exc:`TypeError`).
ru: Класс может реализовывать определенные операции, которые вызываются при использовании специального синтаксиса (например, арифметические операции или индексаця и срезы), путем определения методов со специальными именами. Это Питоновский подход к переопределению операторов, позволяющему классам определять их собственное поведение по отношению к операторам языка. Например, если класс определяет метод под названием «:meth:`__getitem__`» и «``x``» экземпляр этого класса, то «``x[i]``» приблизительно равно «``type(x).__getitem__(x, i)``» . За исключением тех случаев, где это особо оговорено – попытки исполнять операции вызывают исключение, если не определено соответствующего метода (обычно :exc:`AttributeError` или :exc:`TypeError` ) .

source: When implementing a class that emulates any built-in type, it is important that the emulation only be implemented to the degree that it makes sense for the object being modelled. For example, some sequences may work well with retrieval of individual elements, but extracting a slice may not make sense. (One example of this is the :class:`NodeList` interface in the W3C's Document Object Model.)
ru: При реализации класса, который эмулирует любой встроенный тип, важно, что эмуляция должна быть реализована только в той степени, в какой это имеет значение для моделируемого объекта. Например, некоторые последовательности могут хорошо работать с извлечением отдельных элементов, но срезы могут не иметь смысла. (Одним из примеров этого является интерфейс :class:`NodeList` в “W3C’s Document Object Model” .)

source: Basic customization
ru: Основные средства настройки классов

source: Called to create a new instance of class *cls*. :meth:`__new__` is a static method (special-cased so you need not declare it as such) that takes the class of which an instance was requested as its first argument. The remaining arguments are those passed to the object constructor expression (the call to the class). The return value of :meth:`__new__` should be the new object instance (usually an instance of *cls*).
ru: Вызывается для создания нового экземпляра класса (назовём *cls*) . :meth:`__new__` – это статический метод (специальный, создаваемый автоматически) , который принимает в качестве первого аргумента класс, экземпляр которого требуется вернуть. Остальные аргументы такие же, какие передаются конструктору этого же объекта (в выражении «``cls()``» ) . «:meth:`__new__`» должен возвращать новый экземпляр объекта ( обычно экземпляр класса *cls* ) .

source: Typical implementations create a new instance of the class by invoking the superclass's :meth:`__new__` method using ``super(currentclass, cls).__new__(cls[, ...])`` with appropriate arguments and then modifying the newly-created instance as necessary before returning it.
ru: Обычно применяется для создания нового экземпляра класса через вызов метода «:meth:`__new__`» у “суперкласса” данного класса, вызывая «``super(currentclass, cls).__new__(cls[, ...])``» с соответствующими аргументами, и затем модифицируя (при необходимости) новосозданный экземпляр перед его возвращением.

source: If :meth:`__new__` returns an instance of *cls*, then the new instance's :meth:`__init__` method will be invoked like ``__init__(self[, ...])``, where *self* is the new instance and the remaining arguments are the same as were passed to :meth:`__new__`.
ru: Если «:meth:`__new__`» возвращает экземпляр класса *cls* , то будет вызван метод «:meth:`__init__`» этого нового экземпляра : «``__init__(self[, ...])``» , где *self* – это данный новый экземпляр, а остальные аргументы – именно те, которые были переданы в «:meth:`__new__`» .

source: If :meth:`__new__` does not return an instance of *cls*, then the new instance's :meth:`__init__` method will not be invoked.
ru: Если «:meth:`__new__`» не возвращает экземпляр класса *cls* , то метод «:meth:`__init__`» нового экземпляра не будет вызываться.

source: :meth:`__new__` is intended mainly to allow subclasses of immutable types (like int, str, or tuple) to customize instance creation. It is also commonly overridden in custom metaclasses in order to customize class creation.
ru: «:meth:`__new__`» главным образом нужен для того, чтобы дать возможность классам, производным от неизменяемых типов (таких как “int” , “str” , “tuple”) , настраивать создание экземпляров. Он к тому же часто переопределяется в метаклассах для настройки создания класса.

source: Called when the instance is created. The arguments are those passed to the class constructor expression. If a base class has an :meth:`__init__` method, the derived class's :meth:`__init__` method, if any, must explicitly call it to ensure proper initialization of the base class part of the instance; for example: ``BaseClass.__init__(self, [args...])``. As a special constraint on constructors, no value may be returned; doing so will cause a :exc:`TypeError` to be raised at runtime.
ru: Этот метод вызывается при создании соответствующего экземпляра. Его аргументами становятся те, которые были переданы выражению конструктору класса. Если в базовом классе определён метод «:meth:`__init__`» , то метод «:meth:`__init__`» производного класса (если определён) должен явно вызывать его, чтобы гарантировать правильную инициализацию части экземпляра, соответствующей базовому классу ( например : «``BaseClass.__init__(self, [args...])``» ) . Для конструкторов есть особый запрет - они не должны возвращать какого-либо значения - иначе вызывается ошибка :exc:`TypeError` .

source: Called when the instance is about to be destroyed. This is also called a destructor. If a base class has a :meth:`__del__` method, the derived class's :meth:`__del__` method, if any, must explicitly call it to ensure proper deletion of the base class part of the instance. Note that it is possible (though not recommended!) for the :meth:`__del__` method to postpone destruction of the instance by creating a new reference to it. It may then be called at a later time when this new reference is deleted. It is not guaranteed that :meth:`__del__` methods are called for objects that still exist when the interpreter exits.
ru: Этот метод (называемый также деструктор) вызывается, когда данный экземпляр должен быть уничтожен. Если в базовом классе определён метод «:meth:`__del__`» , то метод «:meth:`__del__`» производного класса (если определён) должен явно вызывать его, чтобы гарантировать правильное удаление части экземпляра, соответствующей базовому классу. Заметьте, что метод «:meth:`__del__`» может (хотя это не рекомендуется) отложить удаление экземпляра, создав новую ссылку на него. Он может быть вызван потом, когда будет удалена эта новая ссылка. Не гарантируется, что методы «:meth:`__del__`» будут вызваны для объектов, существующих на момент закрытия интерпретатора.
